"""
МОДУЛЬ 2
Программа из 2-го дз
Сначала пользователь вводит год рождения Пушкина, когда отвечает верно вводит день рождения
Можно использовать свой вариант программы из предыдущего дз, мой вариант реализован ниже
Задание: переписать код используя как минимум 1 функцию
++++++++++++++++++++++
  Программа викторина: Выбрать минимум 5 известных людей и узнать их год рождения. 
  Программа должна по очереди спрашивать у пользователя год рождения знаменитости. 
  После того как пользователь ввел все ответы, программа считает и выводит на экран:
  - количество правильных ответов
  - количество ошибок
  - процент правильных ответов (можно посчитать как ПРАВИЛЬНЫЕ ОТВЕТЫ*100/ВСЕГО ВОПРОСОВ)
  - процент неправильных ответов 
  После вывода информации программа спрашивает пользователя хочет ли он начать игру сначала, 
  если да - то повторяем все сначала, если ответ нет - выходим из программы
"""

